app/views/users/show.html.erb

<div class="reviews">
	<% @user.reviews.each do |r| %>
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."user_id" = ?  [["user_id", 2]]