app/views/games/index.html.erb

<% if params[:game] %>
	<% if !params[:game][:average_rating].blank? %>
		<% @games = [] %>
		<% Game.all.each do |g| %>
---
SELECT "games".* FROM "games" WHERE (rating.average >= '3')
SELECT "games".* FROM "games"

    <p>Available On:</p>
    <%= f.collection_check_boxes :console_ids, Console.all, :id, :name %><br>
---
SELECT "consoles".* FROM "consoles"