app/views/games/new.html.erb

SELECT "consoles".* FROM "consoles"
---
    <p>Available On:</p>
    <%= f.collection_check_boxes :console_ids, Console.all, :id, :name %><br>