app/views/games/show.html.erb

SELECT "consoles".* FROM "consoles" INNER JOIN "console_games" ON "consoles"."id" = "console_games"."console_id" WHERE "console_games"."game_id" = ?  [["game_id", 1]]
---
Release Year:<%= @game.release_year %><br>
Available On: <% @game.consoles.each do |c| %>

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."game_id" = ? AND "reviews"."user_id" = ? LIMIT ?  [["game_id", 1], ["user_id", 10], ["LIMIT", 1]]
---
<div class="review-box">
	<% @review = Review.find_by(game_id: @game.id, user_id: session[:user_id]) %>

SELECT "reviews".* FROM "reviews" WHERE "reviews"."game_id" = ?  [["game_id", 1]]
---
<% @counter = 0 %>
<% @game.reviews.each do |r| %>

SELECT COUNT(*) FROM "reviews" WHERE "reviews"."game_id" = ?  [["game_id", 1]]
---
<script type="text/javascript" charset="utf-8">
$(function() {
  $(".js-ratings").on("click", function() {
    var id = $(this).data("id");
    var game = $(this).data("game");
    var contentid = $(this).data("counter")
    $.get("/games/" + game + "reviews.json", function(obj) {
  	var reviewText = obj["reviews"][contentid]["content"]
        $("#r-" + id).html(reviewText);
      });
    });
  });