app/controllers/games_controller.rb

SELECT  "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def show
		@user = current_user
		@game = Game.find(params[:id])

SELECT "reviews".* FROM "reviews" WHERE "reviews"."game_id" = ?  [["game_id", 1]]
SELECT "users".* FROM "users" INNER JOIN "reviews" ON "users"."id" = "reviews"."user_id" WHERE "reviews"."game_id" = ?  [["game_id", 1]]
INSERT INTO "games" ("name", "release_year", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Horizon Zero Dawn"], ["release_year", 2017], ["created_at", "2018-12-02 18:11:34.514651"], ["updated_at", "2018-12-02 18:11:34.514651"]]
INSERT INTO "reviews" ("rating", "content", "user_id", "game_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["rating", 5], ["content", "---"], ["user_id", 8], ["game_id", 6], ["created_at", "2018-12-02 18:11:34.517508"], ["updated_at", "2018-12-02 18:11:34.517508"]]
---
	def create
		@game = Game.new(games_params)
		@game.reviews.first.user_id = current_user.id
		if @game.save