app/controllers/reviews_controller.rb

SELECT  "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def index
    @game = Game.find(params[:game_id])

INSERT INTO "reviews" ("rating", "content", "user_id", "game_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["rating", 5], ["content", "kkjsadkljsdkl"], ["user_id", 10], ["game_id", 1], ["created_at", "2019-02-04 20:46:27.315098"], ["updated_at", "2019-02-04 20:46:27.315098"]]
---
  def create
    @review = Review.new(rating: params[:review][:rating], game_id: params[:review][:game_id], content: params[:review][:content], user_id: session[:user_id])
    if @review.valid?
      @review.user_id = current_user.id
      @review.save