app/controllers/sessions_controller.rb

INSERT INTO "users" ("name", "password_digest", "created_at", "updated_at", "uid") VALUES (?, ?, ?, ?, ?)
SELECT  "users".* FROM "users" WHERE "users"."uid" = ? LIMIT ?  [["uid", 10156090962451848], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."name" = ? LIMIT ?  [["name", "firstuser"], ["LIMIT", 1]]
---
  def create

	if auth_hash = request.env["omniauth.auth"]
		user = User.find_or_create_by_omniauth(auth_hash)
		session[:user_id] = user.id
		redirect_to '/games'
	else
   		 @user = User.find_by(name: params[:user][:name])