app/controllers/users_controller.rb

	def create
		@user = User.new(user_params)
		if @user.valid?
			@user.save
---
INSERT INTO "users" ("name", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "alex"], ["password_digest", "$2a$10$sjuYzQlGVJzRgNPDE/nkY.VjIK6NwzRgjOFaN2sCZm/9apRzgfSbO"], ["created_at", "2018-12-02 17:21:50.137595"], ["updated_at", "2018-12-02 17:21:50.137595"]]