app/models/game.rb

	def average_rating
		sum = 0
			self.reviews.each do |r|
				sum = sum + r.rating
			end
		sum/self.reviews.count if self.reviews.count > 0
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."game_id" = ?  [["game_id", 1]]
SELECT COUNT(*) FROM "reviews" WHERE "reviews"."game_id" = ?  [["game_id", 1]]