app/models/user.rb

INSERT INTO "users" ("name", "password_digest", "created_at", "updated_at", "uid") VALUES (?, ?, ?, ?, ?)
SELECT  "users".* FROM "users" WHERE "users"."uid" = ? ORDER BY "users"."id" ASC LIMIT ?  [["uid", 10156090962451848], ["LIMIT", 1]]
---
	def self.find_or_create_by_omniauth(auth_hash)
		omniauth_id = auth_hash["uid"]
		self.where(:uid => omniauth_id).first_or_create do |user|

SELECT "reviews".* FROM "reviews" WHERE "reviews"."user_id" = ?  [["user_id", 6]]
---
	def most_liked
		 self.reviews.sort_by { |r| r.rating }.reverse.take(3)