app/views/reviews/index.html.erb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."game_id" = ?  [["game_id", 1]]
---
<div class="reviews">
	<% @game.reviews.each do |r| %>